
import { SajuDataType } from "@/app/types/sajuTypes";

export const gyeData: SajuDataType = {
  "계": {
    남성: {
      인생운: `
{userName}님은 섬세하고 예리한 성향을 가지고 있습니다. 감정이 풍부하며, 작은 것에도 깊이 고민하는 성향이 있습니다.`,
      연애운: `
{userName}님은 조용하고 신중한 연애 스타일을 보입니다. 상대방을 깊이 사랑하지만, 감정을 쉽게 드러내지 않는 편입니다.`,
      궁합운: `
{userName}님은 신금이나 기토와 조화로운 관계를 이루며, 병화나 무토와는 성향 차이가 있을 수 있습니다. 감정을 공유하는 상대와 좋은 관계를 유지할 가능성이 큽니다.`,
      직업운: `
{userName}님은 심리학, 예술, 교육, 연구, 금융 등의 분야에서 두각을 나타낼 가능성이 큽니다. 섬세한 분석력이 필요한 직업이 적합합니다.`,
      학업및시험운: `
{userName}님은 체계적인 학습이 중요합니다. 감성을 활용하는 학습 방식이 효과적일 수 있습니다.`,
      재물운: `
{userName}님은 돈을 모으는 능력이 뛰어나지만, 변덕스러운 소비 습관을 주의해야 합니다.`,
      건강운: `
{userName}님은 신경계 건강과 면역력 관리가 중요합니다. 충분한 휴식과 스트레스 해소가 필요합니다.
`,
    },
    여성: {      인생운: `
{userName}님은 조용하면서도 강한 내면을 가진 사람입니다. 감정이 풍부하고 섬세한 사고를 하며, 직관력이 뛰어납니다.`,
      연애운: `
{userName}님은 감정을 조용히 표현하는 연애 스타일을 보입니다. 상대방에게 헌신적이지만, 가끔은 혼자만의 시간이 필요합니다.`,
      궁합운: `
{userName}님은 신금이나 기토와 잘 어울리며, 병화나 무토와는 의견 차이가 있을 수 있습니다. 부드럽고 따뜻한 상대와 잘 맞습니다.`,
      직업운: `
{userName}님은 상담, 예술, 연구, 철학, 교육 등의 분야에서 능력을 발휘할 가능성이 큽니다. 감성과 직관을 활용하는 직업이 적합합니다.`,
      학업및시험운: `
{userName}님은 논리적 사고와 감성적 접근을 균형 있게 활용하는 것이 중요합니다.`,
      재물운: `
{userName}님은 돈을 모으는 능력이 뛰어나지만, 변덕스러운 소비 습관을 조심해야 합니다.`,
      건강운: `
{userName}님은 신경계 건강과 감정적 안정이 중요합니다. 충분한 휴식과 자기 조절이 필요합니다.      `
    }
  }
};