
import { SajuDataType } from "@/app/types/sajuTypes";

export const giData: SajuDataType = {
  "기": {
    남성: {
      인생운: `
{userName}님은 부드러우면서도 내면적으로 강한 성향을 가진 사람입니다. 유연하게 대처하는 능력이 뛰어나며, 환경에 적응하는 힘이 강합니다.`,
      연애운: `
{userName}님은 연애에서 상대방을 잘 배려하며, 부드럽고 세심한 태도를 보입니다. 상대의 감정을 잘 읽고 조율하는 능력이 뛰어납니다.`,
      궁합운: `
{userName}님은 무토나 병화와 조화로운 관계를 이루며, 계수나 신금과는 성향 차이가 있을 수 있습니다. 부드럽고 따뜻한 상대와 좋은 궁합을 이룹니다.`,
      직업운: `
{userName}님은 상담, 교육, 심리학, 서비스업 등의 분야에서 능력을 발휘할 가능성이 큽니다. 사람들과 협력하는 직업에서 두각을 나타낼 수 있습니다.`,
      학업및시험운: `
{userName}님은 꾸준한 학습을 통해 실력을 쌓아가는 것이 중요합니다. 즉흥적인 학습보다는 장기적인 계획이 필요합니다.`,
      재물운: `
{userName}님은 신중하게 재정을 관리하는 성향이 강합니다. 안정적인 투자에 강점을 가지며, 충동적인 소비를 줄이면 더욱 안정적인 재물을 형성할 수 있습니다.`,
      건강운: `
{userName}님은 소화기 건강과 면역력 관리에 신경 써야 합니다. 규칙적인 식습관과 운동이 중요합니다.
`,
    },
    여성: {
      인생운: `
{userName}님은 온화하고 배려심이 깊은 성향을 가지고 있습니다. 사람들과 조화를 이루며 살아가며, 따뜻한 리더십을 발휘할 수 있습니다.`,
      연애운: `
{userName}님은 상대방을 잘 이해하고 배려하는 연애 스타일을 가집니다. 감성적인 공감 능력이 뛰어나지만, 때로는 자신의 감정을 표현하는 것이 중요합니다.`,
      궁합운: `
{userName}님은 무토나 병화와 잘 어울리며, 계수나 신금과는 의견 차이가 있을 수 있습니다. 서로를 이해하고 배려하는 관계가 중요합니다.`,
      직업운: `
{userName}님은 교육, 상담, 요리, 서비스업 등의 분야에서 능력을 발휘합니다. 사람과의 관계가 중요한 직업이 적합합니다.`,
      학업및시험운: `
{userName}님은 차근차근 실력을 쌓아가는 학습 방식이 잘 맞습니다. 꾸준한 학습 습관이 성과를 높이는 데 도움이 됩니다.`,
      재물운: `
{userName}님은 안정적인 재무 계획을 중요하게 생각하는 성향이 있습니다. 저축과 장기적인 투자에 능하며, 신중한 재정 관리가 필요합니다.`,
      건강운: `
{userName}님은 소화기 건강과 정신적 안정이 중요합니다. 스트레스 관리를 잘하는 것이 건강 유지에 도움이 됩니다.


      `
    }
  }
};