
import { SajuDataType } from "@/app/types/sajuTypes";

export const imData: SajuDataType = {
  "임": {
    남성: {
      인생운: `
{userName}님은 넓은 포용력을 가지고 있으며, 변화에 유연하게 대처하는 성향을 보입니다. 깊은 사고력과 창의적인 아이디어를 가지고 있습니다.`,
      연애운: `
{userName}님은 감성적이고 이해심이 깊은 연애 스타일을 가집니다. 상대방을 배려하고 감싸주는 성향이 강하지만, 가끔은 감정 기복이 심할 수 있습니다.`,
      궁합운: `
{userName}님은 경금이나 갑목과 조화로운 관계를 이루며, 정화나 기토와는 성향이 다를 수 있습니다. 상대방이 자유를 인정해 줄 때 관계가 더욱 원만해집니다.`,
      직업운: `
{userName}님은 예술, 학문, 철학, 과학, 창작 활동 등 창의력이 필요한 직업에서 두각을 나타낼 가능성이 큽니다.`,
      학업및시험운: `
{userName}님은 감성적인 학습 방식이 잘 맞습니다. 즉흥적인 공부보다 체계적인 계획을 세우는 것이 중요합니다.`,
      재물운: `
{userName}님은 재정 관리보다는 돈을 벌어들이는 능력이 뛰어난 편입니다. 다만, 소비가 많아 관리가 필요합니다.`,
      건강운: `
{userName}님은 신장 건강과 면역력에 신경 써야 합니다. 과도한 피로를 피하고 규칙적인 생활 습관이 필요합니다.
`,
    },
    여성: {
      인생운: `
{userName}님은 유연한 사고를 가지고 있으며, 감성이 풍부한 성향을 보입니다. 감정의 흐름을 잘 이해하며, 사람들과 원만한 관계를 유지하는 능력이 뛰어납니다.`,
      연애운: `
{userName}님은 감성적이면서도 자유로운 연애를 선호합니다. 상대방을 배려하지만, 너무 얽매이는 관계를 피하려는 경향이 있습니다.`,
      궁합운: `
{userName}님은 경금이나 갑목과 잘 어울리며, 정화나 기토와는 성향 차이가 있을 수 있습니다. 상대가 감정을 이해하고 존중해 줄 때 좋은 관계를 유지할 수 있습니다.`,
      직업운: `
{userName}님은 문학, 예술, 연구, 철학, 과학 등의 창조적인 분야에서 능력을 발휘할 가능성이 큽니다.`,
      학업및시험운: `
{userName}님은 창의적인 접근 방식이 필요합니다. 너무 논리적인 학습보다는 직관을 활용하는 학습이 효과적입니다.`,
      재물운: `
{userName}님은 돈을 잘 벌지만, 소비가 많을 수 있으므로 재정 관리에 신경 써야 합니다.`,
      건강운: `
{userName}님은 신장 건강과 정신적 안정이 중요합니다. 규칙적인 수면과 스트레스 관리가 필요합니다.


      `
    }
  }
};