export const heavenlyUnion = {
    "갑": "기", "을": "경", "병": "임", "정": "계",
    "무": "신", "기": "갑", "경": "을", "신": "무",
    "임": "병", "계": "정"
  };
  
  export const earthlyUnion = {
    "자": "축", "축": "자",
    "인": "해", "해": "인",
    "묘": "술", "술": "묘",
    "진": "유", "유": "진",
    "사": "신", "신": "사",
    "오": "미", "미": "오"
  };
  
  export const earthlyConflict = {
    "자": "오", "오": "자",
    "축": "미", "미": "축",
    "인": "신", "신": "인",
    "묘": "유", "유": "묘",
    "진": "술", "술": "진",
    "사": "해", "해": "사"
  };